In [59]:
import numpy as np
import pandas as pd

In [60]:
df1 = pd.DataFrame(
    np.random.randint(10, 100, 25).reshape(5, 5),
    columns=list('VWXYZ'),
    index=list('abcde') )
df1

    V   W   X   Y   Z
a  36  10  14  79  45
b  54  66  57  34  31
c  87  64  79  10  15
d  16  21  38  80  70
e  56  62  38  97  15

In [61]:
df1.loc['c', 'X']

79

In [62]:
df1.iloc[2,2]

79

In [63]:
df1.loc['c']['X']

79

In [64]:
df1.loc['c'].X

79

In [65]:
df1.loc['c'][2]

79

In [66]:
df1['X']['c']

79

In [67]:
df1.X['c']

79

In [68]:
df1.X.c

79

In [69]:
df1['X'].c

79

In [70]:
df1.X[2]

79

In [71]:
df2 = pd.read_csv('data/법정동코드 전체자료.txt', sep='\t', encoding='euc-kr')
df2.head()

        법정동코드           법정동명 폐지여부
0  1100000000          서울특별시   존재
1  1111000000      서울특별시 종로구   존재
2  1111010100  서울특별시 종로구 청운동   존재
3  1111010200  서울특별시 종로구 신교동   존재
4  1111010300  서울특별시 종로구 궁정동   존재

In [72]:
suwon = df2[df2['법정동명'].str.contains('경기도 수원시')]
suwon.head(3)

           법정동코드           법정동명 폐지여부
4819  4111000000        경기도 수원시   존재
4820  4111000100    경기도 수원시 반정동   폐지
4821  4111010100  경기도 수원시 팔달로1가   폐지

In [73]:
suwon = suwon[suwon.폐지여부 == '존재']
suwon.head(3)

           법정동코드             법정동명 폐지여부
4819  4111000000          경기도 수원시   존재
4884  4111100000      경기도 수원시 장안구   존재
4913  4111112900  경기도 수원시 장안구 파장동   존재

In [92]:
jangan = suwon[suwon['법정동명'].str.contains('수원시 장안구')]
jangan['법정동명'].str[-3:]

4884    장안구
4913    파장동
4914    정자동
4915    이목동
4916    율전동
4917    천천동
4918    영화동
4919    송죽동
4920    조원동
4921    연무동
4922    광교동
4923    광교동
Name: 법정동명, dtype: object

In [75]:
import seaborn as sns
dt = sns.load_dataset('titanic')

In [76]:
dt.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [77]:
dt.drop(columns=['deck'], inplace=True)
# 'deck' column에 결측치가 너무 많아 분석에 문제가 있음.

In [78]:
dt.age.fillna(dt.age.median(), inplace=True)
dt

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,Southampton,yes,True
888,0,3,female,28.0,1,2,23.4500,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,Queenstown,no,True

In [79]:
ages = pd.DataFrame(dt, columns=["age"])
ages

      age
0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
..    ...
886  27.0
887  19.0
888  28.0
889  26.0
890  32.0

[891 rows x 1 columns]

In [80]:
ages['나이 그룹'] = pd.qcut(dt.age, 3, labels=['age1','age2','age3'])
ages

      age 나이 그룹
0    22.0  age1
1    38.0  age3
2    26.0  age2
3    35.0  age3
4    35.0  age3
..    ...   ...
886  27.0  age2
887  19.0  age1
888  28.0  age2
889  26.0  age2
890  32.0  age3

[891 rows x 2 columns]

In [81]:
dt.pivot_table('survived', 'sex', 'embark_town')

embark_town  Cherbourg  Queenstown  Southampton
sex
female        0.876712    0.750000     0.689655
male          0.305263    0.073171     0.174603

In [82]:
dt.groupby('sex')[['age']].mean()

              age
sex
female  27.929936
male    30.140676